; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.hdr_cursor = type { i8* }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon.1 }
%union.anon.1 = type { %struct.anon.2 }
%struct.anon.2 = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.icmphdr_common = type { i8, i8, i16 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.5, %union.anon.6, %union.anon.7, i16, i16, [6 x i8], [6 x i8] }
%union.anon.5 = type { i32 }
%union.anon.6 = type { [4 x i32] }
%union.anon.7 = type { [4 x i32] }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = dso_local global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 256, i32 0 }, section "maps", align 4, !dbg !78
@redirect_params = dso_local global %struct.bpf_map_def { i32 1, i32 6, i32 6, i32 1, i32 0 }, section "maps", align 4, !dbg !88

!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/david/Escritorio/TSN/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "bfcc14c71c6cf98635aa68e9ac7d9455")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/david/Escritorio/TSN/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9a7f04155c254fef1b7ada5eb82c984c")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51, !76, !73}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !53, line: 33, size: 128, elements: !54)
!53 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !52, file: !53, line: 40, baseType: !56, size: 128)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !53, line: 34, size: 128, elements: !57)
!57 = !{!58, !64, !70}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !56, file: !53, line: 35, baseType: !59, size: 128)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !62)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !61)
!61 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !{!63}
!63 = !DISubrange(count: 16)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !56, file: !53, line: 37, baseType: !65, size: 128)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !68)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !67, line: 25, baseType: !48)
!67 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!68 = !{!69}
!69 = !DISubrange(count: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !56, file: !53, line: 38, baseType: !71, size: 128)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !74)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !67, line: 27, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!74 = !{!75}
!75 = !DISubrange(count: 4)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!77 = !{!0, !78, !88, !90, !94, !103, !111, !118, !123}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 18, type: !80, isLocal: false, isDefinition: true)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !81, line: 33, size: 160, elements: !82)
!81 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/david/Escritorio/TSN/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 34, baseType: !7, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !80, file: !81, line: 35, baseType: !7, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !80, file: !81, line: 36, baseType: !7, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !81, line: 37, baseType: !7, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !81, line: 38, baseType: !7, size: 32, offset: 128)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 25, type: !80, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 366, type: !92, isLocal: false, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !74)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !96, line: 764, type: !97, isLocal: true, isDefinition: true)
!96 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/david/Escritorio/TSN/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !76, !73, !76, !73, !102}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !49, line: 30, baseType: !101)
!101 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !67, line: 32, baseType: !73)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !96, line: 589, type: !105, isLocal: true, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !73, !109}
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !49, line: 31, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !96, line: 33, type: !113, isLocal: true, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!46, !46, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !96, line: 1254, type: !120, isLocal: true, isDefinition: true)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!108, !46, !73, !109}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !96, line: 1764, type: !125, isLocal: true, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!108, !46, !128, !108, !73}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 3179, size: 512, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !143, !149, !154, !155, !156, !160}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !129, file: !6, line: 3183, baseType: !60, size: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !129, file: !6, line: 3186, baseType: !60, size: 8, offset: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !129, file: !6, line: 3187, baseType: !66, size: 16, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !129, file: !6, line: 3188, baseType: !66, size: 16, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !129, file: !6, line: 3191, baseType: !48, size: 16, offset: 48)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !129, file: !6, line: 3196, baseType: !73, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !6, line: 3198, baseType: !138, size: 32, offset: 96)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !6, line: 3198, size: 32, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !138, file: !6, line: 3200, baseType: !60, size: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !138, file: !6, line: 3201, baseType: !72, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !138, file: !6, line: 3204, baseType: !73, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !6, line: 3207, baseType: !144, size: 128, offset: 128)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !6, line: 3207, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !144, file: !6, line: 3208, baseType: !72, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !144, file: !6, line: 3209, baseType: !148, size: 128)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 128, elements: !74)
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !6, line: 3216, baseType: !150, size: 128, offset: 256)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !6, line: 3216, size: 128, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !150, file: !6, line: 3217, baseType: !72, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !150, file: !6, line: 3218, baseType: !148, size: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !129, file: !6, line: 3222, baseType: !66, size: 16, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !129, file: !6, line: 3223, baseType: !66, size: 16, offset: 400)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !129, file: !6, line: 3224, baseType: !157, size: 48, offset: 416)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 48, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 6)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !129, file: !6, line: 3225, baseType: !157, size: 48, offset: 464)
!161 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/david/Escritorio/TSN/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "0f65d57b07088eec24d5031993b90668")
!162 = !{i32 7, !"Dwarf Version", i32 5}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{i32 7, !"frame-pointer", i32 2}
!166 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!167 = distinct !DISubprogram(name: "xdp_icmp_echo_func", scope: !3, file: !3, line: 90, type: !168, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !178)
!168 = !DISubroutineType(types: !169)
!169 = !{!108, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !172)
!172 = !{!173, !174, !175, !176, !177}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !6, line: 2857, baseType: !73, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !171, file: !6, line: 2858, baseType: !73, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !171, file: !6, line: 2859, baseType: !73, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !171, file: !6, line: 2861, baseType: !73, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !171, file: !6, line: 2862, baseType: !73, size: 32, offset: 128)
!178 = !{!179, !180, !181, !182, !187, !196, !197, !198, !199, !227, !254, !255, !256, !263, !264, !265}
!179 = !DILocalVariable(name: "ctx", arg: 1, scope: !167, file: !3, line: 90, type: !170)
!180 = !DILocalVariable(name: "data_end", scope: !167, file: !3, line: 92, type: !46)
!181 = !DILocalVariable(name: "data", scope: !167, file: !3, line: 93, type: !46)
!182 = !DILocalVariable(name: "nh", scope: !167, file: !3, line: 94, type: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !184, line: 33, size: 64, elements: !185)
!184 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/david/Escritorio/TSN/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !183, file: !184, line: 34, baseType: !46, size: 64)
!187 = !DILocalVariable(name: "eth", scope: !167, file: !3, line: 95, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !190, line: 168, size: 112, elements: !191)
!190 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!191 = !{!192, !194, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !189, file: !190, line: 169, baseType: !193, size: 48)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 48, elements: !158)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !189, file: !190, line: 170, baseType: !193, size: 48, offset: 48)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !189, file: !190, line: 171, baseType: !66, size: 16, offset: 96)
!196 = !DILocalVariable(name: "eth_type", scope: !167, file: !3, line: 96, type: !108)
!197 = !DILocalVariable(name: "ip_type", scope: !167, file: !3, line: 97, type: !108)
!198 = !DILocalVariable(name: "icmp_type", scope: !167, file: !3, line: 98, type: !108)
!199 = !DILocalVariable(name: "iphdr", scope: !167, file: !3, line: 99, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !202, line: 86, size: 160, elements: !203)
!202 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "4e88ed297bc3832dfa96a5c9b60cec92")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !214}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !201, file: !202, line: 88, baseType: !60, size: 4, flags: DIFlagBitField, extraData: i64 0)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !201, file: !202, line: 89, baseType: !60, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !201, file: !202, line: 96, baseType: !60, size: 8, offset: 8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !201, file: !202, line: 97, baseType: !66, size: 16, offset: 16)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !202, line: 98, baseType: !66, size: 16, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !201, file: !202, line: 99, baseType: !66, size: 16, offset: 48)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !201, file: !202, line: 100, baseType: !60, size: 8, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !201, file: !202, line: 101, baseType: !60, size: 8, offset: 72)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !201, file: !202, line: 102, baseType: !213, size: 16, offset: 80)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !67, line: 31, baseType: !48)
!214 = !DIDerivedType(tag: DW_TAG_member, scope: !201, file: !202, line: 103, baseType: !215, size: 64, offset: 96)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !201, file: !202, line: 103, size: 64, elements: !216)
!216 = !{!217, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, scope: !215, file: !202, line: 103, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !202, line: 103, size: 64, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !218, file: !202, line: 103, baseType: !72, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !218, file: !202, line: 103, baseType: !72, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !215, file: !202, line: 103, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !202, line: 103, size: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !223, file: !202, line: 103, baseType: !72, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !223, file: !202, line: 103, baseType: !72, size: 32, offset: 32)
!227 = !DILocalVariable(name: "ipv6hdr", scope: !167, file: !3, line: 100, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !230, line: 117, size: 320, elements: !231)
!230 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0a3e356f53cd1c3f0cebfdeaff4287e2")
!231 = !{!232, !233, !234, !238, !239, !240, !241}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !229, file: !230, line: 119, baseType: !60, size: 4, flags: DIFlagBitField, extraData: i64 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !229, file: !230, line: 120, baseType: !60, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !229, file: !230, line: 127, baseType: !235, size: 24, offset: 8)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 24, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 3)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !229, file: !230, line: 129, baseType: !66, size: 16, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !229, file: !230, line: 130, baseType: !60, size: 8, offset: 48)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !229, file: !230, line: 131, baseType: !60, size: 8, offset: 56)
!241 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !230, line: 133, baseType: !242, size: 256, offset: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !229, file: !230, line: 133, size: 256, elements: !243)
!243 = !{!244, !249}
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !242, file: !230, line: 133, baseType: !245, size: 256)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !230, line: 133, size: 256, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !245, file: !230, line: 133, baseType: !52, size: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !245, file: !230, line: 133, baseType: !52, size: 128, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !242, file: !230, line: 133, baseType: !250, size: 256)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !230, line: 133, size: 256, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !250, file: !230, line: 133, baseType: !52, size: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !250, file: !230, line: 133, baseType: !52, size: 128, offset: 128)
!254 = !DILocalVariable(name: "echo_reply", scope: !167, file: !3, line: 101, type: !48)
!255 = !DILocalVariable(name: "old_csum", scope: !167, file: !3, line: 101, type: !48)
!256 = !DILocalVariable(name: "icmphdr", scope: !167, file: !3, line: 102, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr_common", file: !184, line: 51, size: 32, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !184, line: 52, baseType: !60, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !258, file: !184, line: 53, baseType: !60, size: 8, offset: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !258, file: !184, line: 54, baseType: !213, size: 16, offset: 16)
!263 = !DILocalVariable(name: "icmphdr_old", scope: !167, file: !3, line: 103, type: !258)
!264 = !DILocalVariable(name: "action", scope: !167, file: !3, line: 104, type: !73)
!265 = !DILabel(scope: !167, name: "out", file: !3, line: 159)
!266 = !DILocation(line: 0, scope: !167)
!267 = !DILocation(line: 92, column: 38, scope: !167)
!268 = !{!269, !270, i64 4}
!269 = !{!"xdp_md", !270, i64 0, !270, i64 4, !270, i64 8, !270, i64 12, !270, i64 16}
!270 = !{!"int", !271, i64 0}
!271 = !{!"omnipotent char", !272, i64 0}
!272 = !{!"Simple C/C++ TBAA"}
!273 = !DILocation(line: 92, column: 27, scope: !167)
!274 = !DILocation(line: 92, column: 19, scope: !167)
!275 = !DILocation(line: 93, column: 34, scope: !167)
!276 = !{!269, !270, i64 0}
!277 = !DILocation(line: 93, column: 23, scope: !167)
!278 = !DILocation(line: 93, column: 15, scope: !167)
!279 = !DILocation(line: 103, column: 2, scope: !167)
!280 = !DILocalVariable(name: "nh", arg: 1, scope: !281, file: !184, line: 124, type: !284)
!281 = distinct !DISubprogram(name: "parse_ethhdr", scope: !184, file: !184, line: 124, type: !282, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !286)
!282 = !DISubroutineType(types: !283)
!283 = !{!108, !284, !46, !285}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!286 = !{!280, !287, !288}
!287 = !DILocalVariable(name: "data_end", arg: 2, scope: !281, file: !184, line: 125, type: !46)
!288 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !281, file: !184, line: 126, type: !285)
!289 = !DILocation(line: 0, scope: !281, inlinedAt: !290)
!290 = distinct !DILocation(line: 110, column: 13, scope: !167)
!291 = !DILocalVariable(name: "nh", arg: 1, scope: !292, file: !184, line: 79, type: !284)
!292 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !184, file: !184, line: 79, type: !293, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!293 = !DISubroutineType(types: !294)
!294 = !{!108, !284, !46, !285, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !184, line: 64, size: 32, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !184, line: 65, baseType: !299, size: 32)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 2)
!302 = !{!291, !303, !304, !305, !306, !307, !308, !314, !315}
!303 = !DILocalVariable(name: "data_end", arg: 2, scope: !292, file: !184, line: 80, type: !46)
!304 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !292, file: !184, line: 81, type: !285)
!305 = !DILocalVariable(name: "vlans", arg: 4, scope: !292, file: !184, line: 82, type: !295)
!306 = !DILocalVariable(name: "eth", scope: !292, file: !184, line: 84, type: !188)
!307 = !DILocalVariable(name: "hdrsize", scope: !292, file: !184, line: 85, type: !108)
!308 = !DILocalVariable(name: "vlh", scope: !292, file: !184, line: 86, type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !184, line: 42, size: 32, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !310, file: !184, line: 43, baseType: !66, size: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !310, file: !184, line: 44, baseType: !66, size: 16, offset: 16)
!314 = !DILocalVariable(name: "h_proto", scope: !292, file: !184, line: 87, type: !48)
!315 = !DILocalVariable(name: "i", scope: !292, file: !184, line: 88, type: !108)
!316 = !DILocation(line: 0, scope: !292, inlinedAt: !317)
!317 = distinct !DILocation(line: 129, column: 9, scope: !281, inlinedAt: !290)
!318 = !DILocation(line: 93, column: 14, scope: !319, inlinedAt: !317)
!319 = distinct !DILexicalBlock(scope: !292, file: !184, line: 93, column: 6)
!320 = !DILocation(line: 93, column: 24, scope: !319, inlinedAt: !317)
!321 = !DILocation(line: 93, column: 6, scope: !292, inlinedAt: !317)
!322 = !DILocation(line: 97, column: 10, scope: !292, inlinedAt: !317)
!323 = !DILocation(line: 99, column: 17, scope: !292, inlinedAt: !317)
!324 = !{!325, !325, i64 0}
!325 = !{!"short", !271, i64 0}
!326 = !DILocalVariable(name: "h_proto", arg: 1, scope: !327, file: !184, line: 68, type: !48)
!327 = distinct !DISubprogram(name: "proto_is_vlan", scope: !184, file: !184, line: 68, type: !328, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !330)
!328 = !DISubroutineType(types: !329)
!329 = !{!108, !48}
!330 = !{!326}
!331 = !DILocation(line: 0, scope: !327, inlinedAt: !332)
!332 = distinct !DILocation(line: 106, column: 8, scope: !333, inlinedAt: !317)
!333 = distinct !DILexicalBlock(scope: !334, file: !184, line: 106, column: 7)
!334 = distinct !DILexicalBlock(scope: !335, file: !184, line: 105, column: 39)
!335 = distinct !DILexicalBlock(scope: !336, file: !184, line: 105, column: 2)
!336 = distinct !DILexicalBlock(scope: !292, file: !184, line: 105, column: 2)
!337 = !DILocation(line: 70, column: 20, scope: !327, inlinedAt: !332)
!338 = !DILocation(line: 70, column: 46, scope: !327, inlinedAt: !332)
!339 = !DILocation(line: 106, column: 8, scope: !333, inlinedAt: !317)
!340 = !DILocation(line: 106, column: 7, scope: !334, inlinedAt: !317)
!341 = !DILocation(line: 112, column: 18, scope: !334, inlinedAt: !317)
!342 = !DILocation(line: 111, column: 6, scope: !167)
!343 = !DILocalVariable(name: "nh", arg: 1, scope: !344, file: !184, line: 151, type: !284)
!344 = distinct !DISubprogram(name: "parse_iphdr", scope: !184, file: !184, line: 151, type: !345, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !348)
!345 = !DISubroutineType(types: !346)
!346 = !{!108, !284, !46, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!348 = !{!343, !349, !350, !351, !352}
!349 = !DILocalVariable(name: "data_end", arg: 2, scope: !344, file: !184, line: 152, type: !46)
!350 = !DILocalVariable(name: "iphdr", arg: 3, scope: !344, file: !184, line: 153, type: !347)
!351 = !DILocalVariable(name: "iph", scope: !344, file: !184, line: 155, type: !200)
!352 = !DILocalVariable(name: "hdrsize", scope: !344, file: !184, line: 156, type: !108)
!353 = !DILocation(line: 0, scope: !344, inlinedAt: !354)
!354 = distinct !DILocation(line: 112, column: 13, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 111, column: 39)
!356 = distinct !DILexicalBlock(scope: !167, file: !3, line: 111, column: 6)
!357 = !DILocation(line: 158, column: 10, scope: !358, inlinedAt: !354)
!358 = distinct !DILexicalBlock(scope: !344, file: !184, line: 158, column: 6)
!359 = !DILocation(line: 158, column: 14, scope: !358, inlinedAt: !354)
!360 = !DILocation(line: 158, column: 6, scope: !344, inlinedAt: !354)
!361 = !DILocation(line: 161, column: 17, scope: !344, inlinedAt: !354)
!362 = !DILocation(line: 161, column: 21, scope: !344, inlinedAt: !354)
!363 = !DILocation(line: 163, column: 13, scope: !364, inlinedAt: !354)
!364 = distinct !DILexicalBlock(scope: !344, file: !184, line: 163, column: 5)
!365 = !DILocation(line: 163, column: 5, scope: !344, inlinedAt: !354)
!366 = !DILocation(line: 167, column: 14, scope: !367, inlinedAt: !354)
!367 = distinct !DILexicalBlock(scope: !344, file: !184, line: 167, column: 6)
!368 = !DILocation(line: 167, column: 24, scope: !367, inlinedAt: !354)
!369 = !DILocation(line: 167, column: 6, scope: !344, inlinedAt: !354)
!370 = !DILocation(line: 171, column: 9, scope: !344, inlinedAt: !354)
!371 = !DILocation(line: 173, column: 14, scope: !344, inlinedAt: !354)
!372 = !{!373, !271, i64 9}
!373 = !{!"iphdr", !271, i64 0, !271, i64 0, !271, i64 1, !325, i64 2, !325, i64 4, !325, i64 6, !271, i64 8, !271, i64 9, !325, i64 10, !271, i64 12}
!374 = !DILocation(line: 113, column: 15, scope: !375)
!375 = distinct !DILexicalBlock(scope: !355, file: !3, line: 113, column: 7)
!376 = !DILocation(line: 113, column: 7, scope: !355)
!377 = !DILocalVariable(name: "nh", arg: 1, scope: !378, file: !184, line: 132, type: !284)
!378 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !184, file: !184, line: 132, type: !379, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !382)
!379 = !DISubroutineType(types: !380)
!380 = !{!108, !284, !46, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!382 = !{!377, !383, !384, !385}
!383 = !DILocalVariable(name: "data_end", arg: 2, scope: !378, file: !184, line: 133, type: !46)
!384 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !378, file: !184, line: 134, type: !381)
!385 = !DILocalVariable(name: "ip6h", scope: !378, file: !184, line: 136, type: !228)
!386 = !DILocation(line: 0, scope: !378, inlinedAt: !387)
!387 = distinct !DILocation(line: 116, column: 13, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 115, column: 48)
!389 = distinct !DILexicalBlock(scope: !356, file: !3, line: 115, column: 13)
!390 = !DILocation(line: 142, column: 11, scope: !391, inlinedAt: !387)
!391 = distinct !DILexicalBlock(scope: !378, file: !184, line: 142, column: 6)
!392 = !DILocation(line: 142, column: 17, scope: !391, inlinedAt: !387)
!393 = !DILocation(line: 142, column: 15, scope: !391, inlinedAt: !387)
!394 = !DILocation(line: 142, column: 6, scope: !378, inlinedAt: !387)
!395 = !DILocation(line: 136, column: 29, scope: !378, inlinedAt: !387)
!396 = !DILocation(line: 148, column: 15, scope: !378, inlinedAt: !387)
!397 = !{!398, !271, i64 6}
!398 = !{!"ipv6hdr", !271, i64 0, !271, i64 0, !271, i64 1, !325, i64 4, !271, i64 6, !271, i64 7, !271, i64 8}
!399 = !DILocation(line: 117, column: 15, scope: !400)
!400 = distinct !DILexicalBlock(scope: !388, file: !3, line: 117, column: 7)
!401 = !DILocation(line: 117, column: 7, scope: !388)
!402 = !DILocation(line: 107, column: 9, scope: !167)
!403 = !DILocalVariable(name: "nh", arg: 1, scope: !404, file: !184, line: 206, type: !284)
!404 = distinct !DISubprogram(name: "parse_icmphdr_common", scope: !184, file: !184, line: 206, type: !405, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !408)
!405 = !DISubroutineType(types: !406)
!406 = !{!108, !284, !46, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!408 = !{!403, !409, !410, !411}
!409 = !DILocalVariable(name: "data_end", arg: 2, scope: !404, file: !184, line: 207, type: !46)
!410 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !404, file: !184, line: 208, type: !407)
!411 = !DILocalVariable(name: "h", scope: !404, file: !184, line: 210, type: !257)
!412 = !DILocation(line: 0, scope: !404, inlinedAt: !413)
!413 = distinct !DILocation(line: 129, column: 14, scope: !167)
!414 = !DILocation(line: 212, column: 8, scope: !415, inlinedAt: !413)
!415 = distinct !DILexicalBlock(scope: !404, file: !184, line: 212, column: 6)
!416 = !DILocation(line: 212, column: 14, scope: !415, inlinedAt: !413)
!417 = !DILocation(line: 212, column: 12, scope: !415, inlinedAt: !413)
!418 = !DILocation(line: 212, column: 6, scope: !404, inlinedAt: !413)
!419 = !DILocation(line: 218, column: 12, scope: !404, inlinedAt: !413)
!420 = !{!421, !271, i64 0}
!421 = !{!"icmphdr_common", !271, i64 0, !271, i64 1, !325, i64 2}
!422 = !DILocation(line: 130, column: 38, scope: !423)
!423 = distinct !DILexicalBlock(scope: !167, file: !3, line: 130, column: 6)
!424 = !DILocalVariable(name: "iphdr", arg: 1, scope: !425, file: !3, line: 51, type: !200)
!425 = distinct !DISubprogram(name: "swap_src_dst_ipv4", scope: !3, file: !3, line: 51, type: !426, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !428)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !200}
!428 = !{!424, !429}
!429 = !DILocalVariable(name: "tmp", scope: !425, file: !3, line: 54, type: !72)
!430 = !DILocation(line: 0, scope: !425, inlinedAt: !431)
!431 = distinct !DILocation(line: 132, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !423, file: !3, line: 130, column: 65)
!433 = !DILocation(line: 54, column: 22, scope: !425, inlinedAt: !431)
!434 = !{!271, !271, i64 0}
!435 = !DILocation(line: 56, column: 24, scope: !425, inlinedAt: !431)
!436 = !DILocation(line: 56, column: 15, scope: !425, inlinedAt: !431)
!437 = !DILocation(line: 57, column: 15, scope: !425, inlinedAt: !431)
!438 = !DILocation(line: 134, column: 2, scope: !432)
!439 = !DILocation(line: 135, column: 6, scope: !440)
!440 = distinct !DILexicalBlock(scope: !423, file: !3, line: 134, column: 13)
!441 = !DILocalVariable(name: "tmp", scope: !442, file: !3, line: 45, type: !52)
!442 = distinct !DISubprogram(name: "swap_src_dst_ipv6", scope: !3, file: !3, line: 42, type: !443, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !228}
!445 = !{!446, !441}
!446 = !DILocalVariable(name: "ipv6", arg: 1, scope: !442, file: !3, line: 42, type: !228)
!447 = !DILocation(line: 45, column: 18, scope: !442, inlinedAt: !448)
!448 = distinct !DILocation(line: 137, column: 3, scope: !449)
!449 = distinct !DILexicalBlock(scope: !440, file: !3, line: 135, column: 43)
!450 = !DILocation(line: 0, scope: !442, inlinedAt: !448)
!451 = !DILocation(line: 45, column: 2, scope: !442, inlinedAt: !448)
!452 = !DILocation(line: 45, column: 30, scope: !442, inlinedAt: !448)
!453 = !{i64 0, i64 16, !434, i64 0, i64 16, !434, i64 0, i64 16, !434}
!454 = !DILocation(line: 47, column: 8, scope: !442, inlinedAt: !448)
!455 = !DILocation(line: 47, column: 22, scope: !442, inlinedAt: !448)
!456 = !DILocation(line: 48, column: 16, scope: !442, inlinedAt: !448)
!457 = !DILocation(line: 49, column: 1, scope: !442, inlinedAt: !448)
!458 = !DILocalVariable(name: "eth", arg: 1, scope: !459, file: !3, line: 31, type: !188)
!459 = distinct !DISubprogram(name: "swap_src_dst_mac", scope: !3, file: !3, line: 31, type: !460, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !188}
!462 = !{!458, !463}
!463 = !DILocalVariable(name: "h_tmp", scope: !459, file: !3, line: 35, type: !157)
!464 = !DILocation(line: 0, scope: !459, inlinedAt: !465)
!465 = distinct !DILocation(line: 144, column: 2, scope: !167)
!466 = !DILocation(line: 35, column: 3, scope: !459, inlinedAt: !465)
!467 = !DILocation(line: 35, column: 8, scope: !459, inlinedAt: !465)
!468 = !DILocation(line: 37, column: 2, scope: !459, inlinedAt: !465)
!469 = !DILocation(line: 38, column: 2, scope: !459, inlinedAt: !465)
!470 = !DILocation(line: 39, column: 2, scope: !459, inlinedAt: !465)
!471 = !DILocation(line: 40, column: 1, scope: !459, inlinedAt: !465)
!472 = !DILocation(line: 148, column: 22, scope: !167)
!473 = !{!421, !325, i64 2}
!474 = !DILocation(line: 149, column: 17, scope: !167)
!475 = !DILocation(line: 150, column: 16, scope: !167)
!476 = !DILocation(line: 151, column: 16, scope: !167)
!477 = !DILocation(line: 154, column: 38, scope: !167)
!478 = !DILocalVariable(name: "seed", arg: 1, scope: !479, file: !3, line: 77, type: !48)
!479 = distinct !DISubprogram(name: "icmp_checksum_diff", scope: !3, file: !3, line: 76, type: !480, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!48, !48, !257, !257}
!482 = !{!478, !483, !484, !485, !486}
!483 = !DILocalVariable(name: "icmphdr_new", arg: 2, scope: !479, file: !3, line: 78, type: !257)
!484 = !DILocalVariable(name: "icmphdr_old", arg: 3, scope: !479, file: !3, line: 79, type: !257)
!485 = !DILocalVariable(name: "csum", scope: !479, file: !3, line: 81, type: !73)
!486 = !DILocalVariable(name: "size", scope: !479, file: !3, line: 81, type: !73)
!487 = !DILocation(line: 0, scope: !479, inlinedAt: !488)
!488 = distinct !DILocation(line: 154, column: 19, scope: !167)
!489 = !DILocation(line: 83, column: 81, scope: !479, inlinedAt: !488)
!490 = !DILocation(line: 83, column: 9, scope: !479, inlinedAt: !488)
!491 = !DILocalVariable(name: "csum", arg: 1, scope: !492, file: !3, line: 61, type: !73)
!492 = distinct !DISubprogram(name: "csum_fold_helper", scope: !3, file: !3, line: 61, type: !493, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{!48, !73}
!495 = !{!491, !496}
!496 = !DILocalVariable(name: "sum", scope: !492, file: !3, line: 63, type: !73)
!497 = !DILocation(line: 0, scope: !492, inlinedAt: !498)
!498 = distinct !DILocation(line: 84, column: 9, scope: !479, inlinedAt: !488)
!499 = !DILocation(line: 64, column: 14, scope: !492, inlinedAt: !498)
!500 = !DILocation(line: 64, column: 29, scope: !492, inlinedAt: !498)
!501 = !DILocation(line: 64, column: 21, scope: !492, inlinedAt: !498)
!502 = !DILocation(line: 65, column: 14, scope: !492, inlinedAt: !498)
!503 = !DILocation(line: 65, column: 6, scope: !492, inlinedAt: !498)
!504 = !DILocation(line: 66, column: 9, scope: !492, inlinedAt: !498)
!505 = !DILocation(line: 154, column: 17, scope: !167)
!506 = !DILocation(line: 157, column: 2, scope: !167)
!507 = !DILocation(line: 159, column: 1, scope: !167)
!508 = !DILocation(line: 0, scope: !509, inlinedAt: !522)
!509 = distinct !DISubprogram(name: "xdp_stats_record_action", scope: !161, file: !161, line: 24, type: !510, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!73, !170, !73}
!512 = !{!513, !514, !515}
!513 = !DILocalVariable(name: "ctx", arg: 1, scope: !509, file: !161, line: 24, type: !170)
!514 = !DILocalVariable(name: "action", arg: 2, scope: !509, file: !161, line: 24, type: !73)
!515 = !DILocalVariable(name: "rec", scope: !509, file: !161, line: 30, type: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !518, line: 10, size: 128, elements: !519)
!518 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/david/Escritorio/TSN/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "96c2435685fa7da2d24f219444d8659d")
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !517, file: !518, line: 11, baseType: !109, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !517, file: !518, line: 12, baseType: !109, size: 64, offset: 64)
!522 = distinct !DILocation(line: 160, column: 9, scope: !167)
!523 = !{!270, !270, i64 0}
!524 = !DILocation(line: 30, column: 24, scope: !509, inlinedAt: !522)
!525 = !DILocation(line: 31, column: 7, scope: !526, inlinedAt: !522)
!526 = distinct !DILexicalBlock(scope: !509, file: !161, line: 31, column: 6)
!527 = !DILocation(line: 31, column: 6, scope: !509, inlinedAt: !522)
!528 = !DILocation(line: 38, column: 7, scope: !509, inlinedAt: !522)
!529 = !DILocation(line: 38, column: 17, scope: !509, inlinedAt: !522)
!530 = !{!531, !532, i64 0}
!531 = !{!"datarec", !532, i64 0, !532, i64 8}
!532 = !{!"long long", !271, i64 0}
!533 = !DILocation(line: 39, column: 25, scope: !509, inlinedAt: !522)
!534 = !DILocation(line: 39, column: 41, scope: !509, inlinedAt: !522)
!535 = !DILocation(line: 39, column: 34, scope: !509, inlinedAt: !522)
!536 = !DILocation(line: 39, column: 19, scope: !509, inlinedAt: !522)
!537 = !DILocation(line: 39, column: 7, scope: !509, inlinedAt: !522)
!538 = !DILocation(line: 39, column: 16, scope: !509, inlinedAt: !522)
!539 = !{!531, !532, i64 8}
!540 = !DILocation(line: 41, column: 9, scope: !509, inlinedAt: !522)
!541 = !DILocation(line: 41, column: 2, scope: !509, inlinedAt: !522)
!542 = !DILocation(line: 42, column: 1, scope: !509, inlinedAt: !522)
!543 = !DILocation(line: 161, column: 1, scope: !167)
!544 = !DILocation(line: 160, column: 2, scope: !167)
!545 = distinct !DISubprogram(name: "xdp_redirect_func", scope: !3, file: !3, line: 165, type: !168, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !558, !559}
!547 = !DILocalVariable(name: "ctx", arg: 1, scope: !545, file: !3, line: 165, type: !170)
!548 = !DILocalVariable(name: "data_end", scope: !545, file: !3, line: 167, type: !46)
!549 = !DILocalVariable(name: "data", scope: !545, file: !3, line: 168, type: !46)
!550 = !DILocalVariable(name: "nh", scope: !545, file: !3, line: 169, type: !183)
!551 = !DILocalVariable(name: "eth", scope: !545, file: !3, line: 170, type: !188)
!552 = !DILocalVariable(name: "eth_type", scope: !545, file: !3, line: 171, type: !108)
!553 = !DILocalVariable(name: "action", scope: !545, file: !3, line: 172, type: !108)
!554 = !DILocalVariable(name: "dst", scope: !545, file: !3, line: 175, type: !555)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 56, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 7)
!558 = !DILocalVariable(name: "ifindex", scope: !545, file: !3, line: 178, type: !7)
!559 = !DILabel(scope: !545, name: "out", file: !3, line: 196)
!560 = !DILocation(line: 0, scope: !545)
!561 = !DILocation(line: 167, column: 38, scope: !545)
!562 = !DILocation(line: 167, column: 27, scope: !545)
!563 = !DILocation(line: 167, column: 19, scope: !545)
!564 = !DILocation(line: 168, column: 34, scope: !545)
!565 = !DILocation(line: 168, column: 23, scope: !545)
!566 = !DILocation(line: 168, column: 15, scope: !545)
!567 = !DILocation(line: 175, column: 16, scope: !545)
!568 = !DILocation(line: 0, scope: !281, inlinedAt: !569)
!569 = distinct !DILocation(line: 187, column: 13, scope: !545)
!570 = !DILocation(line: 0, scope: !292, inlinedAt: !571)
!571 = distinct !DILocation(line: 129, column: 9, scope: !281, inlinedAt: !569)
!572 = !DILocation(line: 93, column: 14, scope: !319, inlinedAt: !571)
!573 = !DILocation(line: 93, column: 24, scope: !319, inlinedAt: !571)
!574 = !DILocation(line: 93, column: 6, scope: !292, inlinedAt: !571)
!575 = !DILocation(line: 97, column: 10, scope: !292, inlinedAt: !571)
!576 = !DILocation(line: 192, column: 2, scope: !545)
!577 = !DILocation(line: 193, column: 11, scope: !545)
!578 = !DILocation(line: 196, column: 1, scope: !545)
!579 = !DILocation(line: 0, scope: !509, inlinedAt: !580)
